TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB_HHID/BDF_BCDF_USB_HHID_CK_RX65N_V_2/trash/2025-01-12-13-43-35/src/smc_gen/r_usb_hhid/src/r_usb_hhid_driver.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2014(2023) Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_usb_hhid_driver.c
 * Description  : Host HID class driver code
 ***********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *         : 08.01.2014 1.00 First Release
 *         : 26.12.2014 1.10 RX71M is added
 *         : 30.09.2015 1.11 RX63N/RX631 is added.
 *         : 30.09.2016 1.20 RX65N/RX651 is added.
 *         : 26.01.2017 1.21 hid_class_request_complete()is deleted. usb_hhid_read_complete(),
 *                           usb_hhid_write_complete()is fixed.
 *         : 30.09.2017 1.22 Change function name ""->""
 *                           "hid_suspended"->"usb_hid_suspended"
 *                           "hid_configured"->"usb_hid_configured"
 *                           "hid_detach"->"usb_hid_detach"
 *                           "hid_resume_complete"->"usb_hid_resume_complete"
 *                           "hhid_read_complete"->"usb_hhid_read_complete"
 *                           "hhid_write_complete"->"usb_hhid_write_complete"
 *         : 31.03.2018 1.23 Supporting Smart Configurator 
 *         : 16.11.2018 1.24 Supporting BSP_CFG_RTOS_USED
 *         : 31.05.2019 1.26 Added support for GNUC and ICCRX.
 *         : 01.03.2020 1.30 RX72N/RX66N is added and uITRON is supported.
 *         : 30.09.2023 1.42 USBX HCDC is supported.
 ***********************************************************************************************************************/

/******************************************************************************
 Includes   <System Includes> , "Project Includes"
 ******************************************************************************/
#include <string.h>

#include "r_usb_basic_if.h"
#include "r_usb_typedef.h"
#include "r_usb_extern.h"
#include "r_usb_bitdefine.h"
#include "r_usb_hhid_if.h"
#include "r_usb_hhid.h"
#include "r_rtos_abstract.h"
#include "r_usb_cstd_rtos.h"

/******************************************************************************
 Exported global variables
 ******************************************************************************/


#if defined(USB_CFG_HHID_USE)
  #if (BSP_CFG_RTOS_USED != 5)    /* !Azure RTOS */

/******************************************************************************
 Private global variables and functions
 ******************************************************************************/
/* variables */
static uint16_t  g_usb_hhid_request_setup[USB_NUM_USBIP][5];   /* Control Transfer Request field */
static usb_utr_t usb_shhid_string_req[USB_NUM_USBIP];               /* Request for String discriptor */

/* functions */
static uint16_t  usb_hhid_cmd_submit (usb_utr_t *ptr, usb_cb_t complete);

#if (BSP_CFG_RTOS_USED)
uint16_t usb_hhid_get_string_info(usb_utr_t *mess, uint16_t addr, uint16_t string);
uint16_t usb_hhid_req_trans_wait_tmo(uint16_t tmo);
void     usb_hhid_req_trans_result(usb_utr_t *p_mess, uint16_t data1, uint16_t data2);

#else /* (BSP_CFG_RTOS_USED) */
static void      usb_hhid_check_result (usb_utr_t *ptr, uint16_t unused, uint16_t status);
static void      usb_hhid_enumeration (usb_utr_t *mess);
#endif /* (BSP_CFG_RTOS_USED) */

/******************************************************************************
 Exported global variables (to be accessed by other files)
 ******************************************************************************/
/* Host HID TPL */
const uint16_t g_usb_hhid_devicetpl[] =
{
    USB_CFG_TPLCNT, /* Number of tpl table */
    0, /* Reserved */
    USB_CFG_TPL /* Vendor ID, Product ID */
};

uint16_t  g_usb_hhid_protocol[USB_NUM_USBIP][USB_MAXDEVADDR];               /* HID Device protocol(Mouse/Keyboard) */
uint16_t  g_usb_hhid_num_endpoint[USB_NUM_USBIP][USB_MAXDEVADDR];           /* Num Endpoints */
uint16_t  g_usb_hhid_outpipe_support[USB_NUM_USBIP][USB_MAXDEVADDR];        /* OUT pipe support */
uint8_t   g_usb_hhid_string_data[USB_NUM_USBIP][USB_HHID_CLSDATASIZE];
uint16_t  g_usb_hhid_devaddr[USB_NUM_USBIP];                                /* Device Address */
uint16_t  g_usb_hhid_enum_seq[USB_NUM_USBIP];                               /* Enumeration Sequence */
uint16_t  g_usb_hhid_speed[USB_NUM_USBIP];                                  /* Device speed */
uint8_t  *g_p_usb_hhid_config_table[USB_NUM_USBIP];                         /* Configuration Descriptor Table */
uint8_t  *g_p_usb_hhid_device_table[USB_NUM_USBIP];                         /* Device Descriptor Table */
uint8_t  *g_p_usb_hhid_interface_table[USB_NUM_USBIP];                      /* Interface Descriptor Table */

