TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB_HHID/BDF_BCDF_USB_HHID_CK_RX65N_V_2/trash/2025-01-12-13-43-35/src/smc_gen/r_usb_hhid/src/r_usb_hhid_driver.c
/******************************************************************************
 Renesas Abstracted USB Driver functions
 ******************************************************************************/
#if (BSP_CFG_RTOS_USED == 0)    /* Non-OS */
/******************************************************************************
 Function Name   : usb_hhid_check_result
 Description     : String Descriptor receive complete callback.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t unused      : Not used
                 : uint16_t status      : Not used
 Return          : none
 ******************************************************************************/
static void usb_hhid_check_result (usb_utr_t *ptr, uint16_t unused, uint16_t status)
{
    usb_mh_t p_blf;
    usb_er_t err;
    usb_clsinfo_t *cp;

    /* Get mem pool blk */
    if ( USB_PGET_BLK(USB_HHID_MPL, &p_blf) == USB_OK)
    {
        cp = (usb_clsinfo_t*) p_blf;
        cp->msghead = (usb_mh_t) USB_NULL;
        cp->msginfo = USB_HHID_TCMD_OPEN;
        cp->ip = ptr->ip;
        cp->ipp = ptr->ipp;

        /* Send message */
        err = USB_SND_MSG(USB_HHID_MBX, (usb_msg_t* )cp);
        if (USB_OK != err)
        {
            /* error */
            err = USB_REL_BLK(USB_HHID_MPL, (usb_mh_t )p_blf);
            USB_PRINTF0( "### usb_open_hstd function snd_msg error\n");
        }
    }
    else
    {
        /* Error */
        /* WAIT_LOOP */
        while (1)
        {
            /* error */
        }
    }
}
/******************************************************************************
 End of function usb_hhid_check_result
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhid_enumeration
 Description     : Enumeration( Get String Descriptor ) and Pipe tabele set.
 Arguments       : usb_utr_t *mess      : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hhid_enumeration (usb_utr_t *mess)
{
    uint16_t retval;
    uint8_t string;
    uint8_t *p_desc;
    uint8_t *p_iftable;
    uint16_t desc_len;
    uint8_t protocol;
#ifdef USB_DEBUGPRINT_PP
    uint8_t *table;
    uint8_t pdata[32],j;
#endif /* #ifdef USB_DEBUGPRINT_PP */

    /* Branch for Enumeration Sequence */
    switch (g_usb_hhid_enum_seq[mess->ip])
    {
        /* Enumeration Sequence String Descriptor #0 receive request */
        case USB_HHID_ENUM_STR_DT0_REQ :

            /* Get String descriptor */
            usb_hhid_get_string_desc(mess, g_usb_hhid_devaddr[mess->ip], (uint16_t) 0,
                    (usb_cb_t) &usb_hhid_check_result);

            /* String Descriptor #0 Receive wait */
            g_usb_hhid_enum_seq[mess->ip]++;
        break;

            /* Enumeration Sequence String Descriptor #0 Receive complete */
        case USB_HHID_ENUM_STR_DT0_WAIT :

            /* String descriptor check */
            if ((usb_er_t) USB_CTRL_END == mess->status)
            {
                /* Set iProduct */
                string = g_p_usb_hhid_device_table[mess->ip][15];

                /* Get String descriptor */
                usb_hhid_get_string_desc(mess, g_usb_hhid_devaddr[mess->ip], (uint16_t) string,
                        (usb_cb_t) &usb_hhid_check_result);
            }

            /* StringDescriptor iProduct Receive */
            g_usb_hhid_enum_seq[mess->ip]++;
        break;

            /* StringDescriptor iProduct Receive complete */
        case USB_HHID_ENUM_STR_IPRODUCT_WAIT :

            /* String descriptor check */
            if ((usb_er_t) USB_CTRL_END == mess->status)
            {
#ifdef USB_DEBUGPRINT_PP
                /* String descriptor iProduct Address set */
                table = (uint8_t*) &g_usb_hhid_string_data[mess->ip];

                /* String descriptor bLength check */
                if (table[0] < (uint8_t) (32 * 2 + 2))
                {
                    /* Number of characters = bLength /2 -1  */
                    /* 1 character 16bit(UNICODE String) */
                    table[0] = (uint8_t) (table[0] / 2 - 1);
                }
                else
                {
                    /* Number of characters = 32 set */
                    table[0] = (uint8_t) 32;
                }
                /* WAIT_LOOP */
                for (j = 0; j < table[0]; j++)
                {
                    pdata[j] = table[j * 2 + 2];
                }
                pdata[table[0]] = 0;

                /* Display Product name */
                USB_PRINTF1("  %s\n", pdata);
#endif /* #ifdef USB_DEBUGPRINT_PP */
            }
            else
            {
                USB_PRINTF0("*** Product name error\n");
            }

            protocol = usb_hhid_get_hid_protocol(mess->ip, g_usb_hhid_devaddr[mess->ip]); /* Get HID Protocol */
            if ((USB_HID_KEYBOARD != protocol) && (USB_HID_MOUSE != protocol))
            {
                USB_PRINTF0("### Device information error !\n");

                /* Enumeration Sequence Complete */
                g_usb_hhid_enum_seq[mess->ip] = USB_HHID_ENUM_COMPLETE;

                /* Enumeration class check error */
                retval = USB_ERROR;
            }

            p_desc = g_p_usb_hhid_config_table[mess->ip];

            desc_len = ((uint16_t) *(p_desc + 3)) << 8;
            desc_len += (uint16_t) *(p_desc + 2);

            /* Searching InterfaceDescriptor */
            p_iftable = g_p_usb_hhid_interface_table[mess->ip];

            desc_len = desc_len - (p_iftable - p_desc);

            /* pipe information table set */
            retval = usb_hhid_pipe_info(mess, p_iftable, g_usb_hhid_speed[mess->ip], desc_len);
            if (USB_ERROR == retval)
            {
                USB_PRINTF0("### Device information error !\n");

                /* Enumeration Sequence Complete */
                g_usb_hhid_enum_seq[mess->ip] = USB_HHID_ENUM_COMPLETE;

