TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB_HHID/BDF_BCDF_USB_HHID_CK_RX65N_V_2/trash/2025-01-12-13-43-35/src/smc_gen/r_usb_hhid/src/r_usb_hhid_driver.c
                /* Enumeration class check error */
                retval = USB_ERROR;
                usb_hstd_connect_err_event_set(mess->ip);
            }
            else
            {
                /* Enumeration Sequence Complete */
                g_usb_hhid_enum_seq[mess->ip] = USB_HHID_ENUM_COMPLETE;

                /* Enumeration class check OK */
                retval = USB_OK;
            }

            /* return to MGR */
            usb_hstd_return_enu_mgr(mess, retval);
        break;
        default :
            g_usb_hhid_enum_seq[mess->ip] = USB_HHID_ENUM_STR_DT0_REQ;
            usb_hstd_return_enu_mgr(mess, USB_ERROR);            /* Return to MGR */
            usb_hstd_connect_err_event_set(mess->ip);
        break;
    }
}
/******************************************************************************
 End of function usb_hhid_enumeration
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhid_task
 Description     : Host HIT Task
 Argument        : rtos_task_arg_t stacd   : Start code
 Return value    : none
 ******************************************************************************/
void usb_hhid_task (rtos_task_arg_t stacd)
{
    usb_utr_t *p_mess;
    usb_er_t err = 0l;

    err = USB_TRCV_MSG(USB_HHID_MBX, (usb_msg_t** )&p_mess, (uint16_t )3000);
    if (USB_OK == err)
    {
        switch (p_mess->msginfo)
        {
            case USB_HHID_TCMD_OPEN :
                usb_hhid_enumeration(p_mess);
            break;

            default :
            break;
        }
        err = USB_REL_BLK(USB_HHID_MPL, (usb_mh_t )p_mess);
        if (USB_OK != err)
        {
            USB_PRINTF0("### USB HHID Task rel_blk error\n");
        }

        /* Conditional compile dep. on OS usage. */
    }
    else
    {
        return;
    }
}
/******************************************************************************
 End of function usb_hhid_task
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED == 0) */

/******************************************************************************
 Function Name   : usb_hhid_pipe_info
 Description     : pipe information table set
 Arguments       : usb_utr_t *mess         : Pointer to usb_utr_t structure.
                 : uint8_t *table          : Descriptor store address
                 : uint16_t speed          : Conect Dpeed(Hi/Full/...)
                 : uint16_t length         : Descriptor total lenght
 Return value    : uint16_t                : Error info
 ******************************************************************************/
uint16_t usb_hhid_pipe_info (usb_utr_t *ptr, uint8_t *table, uint16_t speed, uint16_t length)
{
    /* Offset for Descriptor Top Address */
    uint16_t ofdsc;
    uint16_t pipe_no;
    uint16_t detect_in_pipe = USB_OFF;
    uint16_t detect_out_pipe = USB_ON;

    usb_pipe_table_reg_t    ep_tbl;

    /* Check configuration descriptor */
    if (USB_DT_INTERFACE != table[1])
    {
        USB_PRINTF0("### Descriptor is not Interface descriptor.\n");
        return USB_ERROR;
    }

    /* Descriptor Address set */
    ofdsc = table[0];

    g_usb_hhid_outpipe_support[ptr->ip][g_usb_hhid_devaddr[ptr->ip]] = USB_OFF;

    if (USB_HID_OTHER == g_usb_hhid_protocol[ptr->ip][g_usb_hhid_devaddr[ptr->ip]])
    {
        if (2 == g_usb_hhid_num_endpoint[ptr->ip][g_usb_hhid_devaddr[ptr->ip]])
        {
            detect_out_pipe = USB_OFF;
        }
    }

    /* Loop for Endpoint Descriptor search */
    /* WAIT_LOOP */
    while (ofdsc < length)
    {
        /* Endpoint Descriptor */
        if (USB_DT_ENDPOINT == table[ofdsc + USB_EP_B_DESCRIPTORTYPE])
        {
            /* Check pipe information */
            pipe_no = usb_hstd_make_pipe_reg_info (ptr->ip, g_usb_hhid_devaddr[ptr->ip], USB_HHID,
                                                  speed, &table[ofdsc], &ep_tbl);
            if ( USB_NULL == pipe_no)
            {
                return USB_ERROR;
            }
            else
            {
                usb_hstd_set_pipe_info (ptr->ip, pipe_no, &ep_tbl);
            }

            if (USB_DIR_H_IN == (ep_tbl.pipe_cfg & USB_DIRFIELD))
            {
                /* Get Max Packet size */
                detect_in_pipe = USB_ON;
            }
            else if (USB_DIR_H_OUT == (ep_tbl.pipe_cfg & USB_DIRFIELD))
            {
                g_usb_hhid_outpipe_support[ptr->ip][g_usb_hhid_devaddr[ptr->ip]] = USB_ON;
                detect_out_pipe = USB_ON;
            }
            else
            {
                /* error */
            }

            if ((USB_ON == detect_in_pipe) && (USB_ON == detect_out_pipe))
            {
                    return USB_OK;
            }
        }
        ofdsc += table[ofdsc];/* Next descriptor point set */
    }
    return USB_ERROR;
}
/******************************************************************************
 End of function usb_hhid_pipe_info
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hhid_get_string_desc
 Description     : Set GetDescriptor
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     addr        : device address
                 : uint16_t     string      : descriptor index
                 : usb_cb_t     complete    : callback function
 Return value    : uint16_t                 : error info
 ******************************************************************************/
uint16_t usb_hhid_get_string_desc (usb_utr_t *ptr, uint16_t addr, uint16_t string, usb_cb_t complete)
{
    uint16_t i;

    if (0 ==  string)
    {
        g_usb_hhid_request_setup[ptr->ip][2] = (uint16_t) 0x0000;
        g_usb_hhid_request_setup[ptr->ip][3] = (uint16_t) 0x0004;
    }
    else
    {
        /* Set LanguageID */
        g_usb_hhid_request_setup[ptr->ip][2] = (uint16_t) (g_usb_hhid_string_data[ptr->ip][2]);
        g_usb_hhid_request_setup[ptr->ip][2] |= (uint16_t) ((uint16_t) (g_usb_hhid_string_data[ptr->ip][3]) << 8);
        g_usb_hhid_request_setup[ptr->ip][3] = (uint16_t) USB_HHID_CLSDATASIZE;
    }
    g_usb_hhid_request_setup[ptr->ip][0] = USB_GET_DESCRIPTOR | USB_DEV_TO_HOST | USB_STANDARD | USB_DEVICE;
    g_usb_hhid_request_setup[ptr->ip][1] = (uint16_t) (USB_STRING_DESCRIPTOR + string);
    g_usb_hhid_request_setup[ptr->ip][4] = addr;

    /* WAIT_LOOP */
    for (i = 0; i < g_usb_hhid_request_setup[ptr->ip][3]; i++)
    {
        g_usb_hhid_string_data[ptr->ip][i] = (uint8_t) 0xFF;
    }

    return usb_hhid_cmd_submit(ptr, complete);
}
/******************************************************************************
 End of function usb_hhid_get_string_desc
 ******************************************************************************/

