TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB_HHID/BDF_BCDF_USB_HHID_CK_RX65N_V_2/trash/2025-01-12-13-43-35/src/smc_gen/r_usb_hhid/src/r_usb_hhid_driver.c
/******************************************************************************
 Function Name   : usb_hhid_cmd_submit
 Description     : command submit
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : usb_cb_t     complete    : callback function
 Return value    : uint16_t                  : USB_DONE
 ******************************************************************************/
static uint16_t usb_hhid_cmd_submit (usb_utr_t *ptr, usb_cb_t complete)
{
    usb_er_t err;
#if (BSP_CFG_RTOS_USED)
    uint16_t hhid_retval;
#endif /* (BSP_CFG_RTOS_USED) */

    usb_shhid_string_req[ptr->ip].p_tranadr = (void*) g_usb_hhid_string_data[ptr->ip];
    usb_shhid_string_req[ptr->ip].complete = complete;
    usb_shhid_string_req[ptr->ip].tranlen = (uint32_t) g_usb_hhid_request_setup[ptr->ip][3];
    usb_shhid_string_req[ptr->ip].keyword = USB_PIPE0;
    usb_shhid_string_req[ptr->ip].p_setup = g_usb_hhid_request_setup[ptr->ip];
    usb_shhid_string_req[ptr->ip].segment = USB_TRAN_END;

    usb_shhid_string_req[ptr->ip].ip = ptr->ip;
    usb_shhid_string_req[ptr->ip].ipp = ptr->ipp;

#if (BSP_CFG_RTOS_USED)
    err = usb_hstd_transfer_start_req(&usb_shhid_string_req[ptr->ip]);
    if (USB_OK == err)
    {
        hhid_retval = usb_hhid_req_trans_wait_tmo((uint16_t)3000);
        if (USB_DATA_STALL == hhid_retval)
        {
            USB_PRINTF0("*** GetStringDesc STALL !\n");
            return USB_ERROR;
        }
        else if (USB_DATA_TMO == hhid_retval)
        {
            USB_PRINTF0("*** GetStringDesc Timeout error !\n");
            return USB_ERROR;
        }
        else if (USB_CTRL_END != hhid_retval)
        {
            USB_PRINTF0("*** GetStringDesc error !\n");
            return USB_ERROR;
        }
        else
        {
            return USB_OK;
        }
    }
    else
    {
        return USB_ERROR;
    }

#else /* (BSP_CFG_RTOS_USED) */
    err = usb_hstd_transfer_start_req(&usb_shhid_string_req[ptr->ip]);
    if (USB_QOVR == err)
    {
        /* error */
        USB_PRINTF0( "### usb_hhid_cmd_submit() : USB_E_QOVR \n");
    }

    return USB_OK;
#endif  /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hhid_cmd_submit
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hid_suspended
 Description     : Suspended state process
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
 Arguments       : uint16_t     devadr      : Device Adrress
 Return value    : none
 ******************************************************************************/
void usb_hid_suspended (usb_utr_t *ptr, uint16_t devadr)
{
    usb_ctrl_t ctrl;

    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = devadr;
    ctrl.type = USB_HHID;
#if (BSP_CFG_RTOS_USED == 1)        /* FreeRTOS */
    ctrl.p_data = (void *)ptr->task_id;
#endif /* (BSP_CFG_RTOS_USED == 1) */
    usb_set_event(USB_STS_SUSPEND, &ctrl);
} /* End of function hid_suspended() */
/******************************************************************************
 End of function usb_hid_suspended
 ******************************************************************************/

/******************************************************************************
 Callback functions
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hid_configured
 Description     : Callback function for HID device configuered
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     devadr  : Device Adrress
                 : uint16_t     data2   : Not use
 Return value    : none
 ******************************************************************************/
void usb_hid_configured (usb_utr_t *ptr, uint16_t devadr, uint16_t data2)
{
    usb_ctrl_t ctrl;

    usb_hhid_set_pipe_registration(ptr, devadr); /* Host HID Pipe registration */
    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = devadr;
    ctrl.type = USB_HHID;
    usb_set_event(USB_STS_CONFIGURED, &ctrl); /* Set Event()  */
}
/******************************************************************************
 End of function usb_hid_configured
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hid_detach
 Description     : Callback function for HID device detach
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     devadr  : Device Adrress
                 : uint16_t     data2   : Not use
 Return value    : none
 ******************************************************************************/
void usb_hid_detach (usb_utr_t *ptr, uint16_t devadr, uint16_t data2)
{
    usb_ctrl_t ctrl;

    usb_hstd_clr_pipe_table (ptr->ip, devadr);
    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = devadr;
    ctrl.type = USB_HHID;
    usb_set_event(USB_STS_DETACH, &ctrl); /* Set Event()  */
}
/******************************************************************************
 End of function usb_hid_detach
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hid_resume_complete
 Description     : Resume complete callback.
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     devadr  : Device Adrress
                 : uint16_t     data2   : Not use
 Return value    : none
 ******************************************************************************/
void usb_hid_resume_complete (usb_utr_t *ptr, uint16_t devadr, uint16_t data2)
{
    usb_ctrl_t ctrl;

