TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB_HHID/BDF_BCDF_USB_HHID_CK_RX65N_V_2/trash/2025-01-12-13-43-35/src/smc_gen/r_usb_hhid/src/r_usb_hhid_driver.c
    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = devadr;
    ctrl.type = USB_HHID;
#if (BSP_CFG_RTOS_USED == 1)        /* FreeRTOS */
    ctrl.p_data = (void *)ptr->task_id;
#endif /* (BSP_CFG_RTOS_USED == 1) */
    usb_set_event(USB_STS_RESUME, &ctrl);
}
/******************************************************************************
 End of function usb_hid_resume_complete
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhid_read_complete
 Description     : data receive complete process.
 Arguments       : usb_utr_t    *mess   : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : Not used
                 : uint16_t     data2   : Not used
 Return value    : none
 ******************************************************************************/
void usb_hhid_read_complete (usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    ctrl.module  = mess->ip;                                    /* Module number setting */
    ctrl.pipe    = mess->keyword;                               /* Pipe number setting */
    ctrl.address = usb_hstd_get_devsel(mess, ctrl.pipe) >> 12;
    ctrl.type    = USB_HHID;                                    /* hid Data class  */
    ctrl.size    = mess->read_req_len - mess->tranlen;

    switch (mess->status)
    {
        case USB_DATA_OK :
            ctrl.status = USB_SUCCESS;
        break;
        case USB_DATA_SHT :
            ctrl.status = USB_ERR_SHORT;
        break;
        case USB_DATA_OVR :
            ctrl.status = USB_ERR_OVER;
        break;
        case USB_DATA_ERR :
        default :
            ctrl.status = USB_ERR_NG;
        break;
    }
#if (BSP_CFG_RTOS_USED == 1)                                    /* FreeRTOS */
    ctrl.p_data = (void *)mess->task_id;
#endif /* (BSP_CFG_RTOS_USED == 1) */

    usb_set_event(USB_STS_READ_COMPLETE, &ctrl);                /* Set Event()  */
}
/******************************************************************************
 End of function usb_hhid_read_complete
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhid_write_complete
 Description     : data transfer complete process.
 Arguments       : usb_utr_t    *mess   : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : Not used
                 : uint16_t     data2   : Not used
 Return value    : none
 ******************************************************************************/
void usb_hhid_write_complete (usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    ctrl.module  = mess->ip;                                    /* Module number setting */
    ctrl.pipe    = mess->keyword;                               /* Pipe number setting */
    ctrl.address = usb_hstd_get_devsel(mess, ctrl.pipe) >> 12;
    ctrl.type    = USB_HHID;                                    /* hid Data class  */

    if (USB_DATA_NONE == mess->status)                          /* USB_CFG_PHID_INT_OUT */
    {
        ctrl.status = USB_SUCCESS;
    }
    else
    {
        ctrl.status = USB_ERR_NG;
    }
#if (BSP_CFG_RTOS_USED == 1)                                    /* FreeRTOS */
    ctrl.p_data = (void *)mess->task_id;
#endif /* (BSP_CFG_RTOS_USED == 1) */

    usb_set_event(USB_STS_WRITE_COMPLETE, &ctrl);               /* Set Event()  */
}
/******************************************************************************
 End of function usb_hhid_write_complete
 ******************************************************************************/

/******************************************************************************
 Initialization functions
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hhid_init
 Description     : Initialize of Host HID driver.
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : not use
                 : uint16_t     data2   : not use
 Return value    : none
 ******************************************************************************/
void usb_hhid_init (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    static uint8_t init = 0;
    uint16_t    i;

    if (0 == (init & (1 << ptr->ip)))
    {
        /* WAIT_LOOP */
        for (i =0; i< (USB_MAXDEVADDR + 1); i++)
        {
            g_usb_hhid_protocol[ptr->ip][i] = 0;
            g_usb_hhid_num_endpoint[ptr->ip][i] = 0;
            g_usb_hhid_outpipe_support[ptr->ip][i] = 0;
        }

        memset(g_usb_hhid_string_data[ptr->ip], 0, USB_HHID_CLSDATASIZE);
        memset(g_usb_hhid_request_setup[ptr->ip], 0, (5 * 2));
        memset((void *)&usb_shhid_string_req[ptr->ip], 0,sizeof(usb_utr_t));

        g_usb_hhid_devaddr[ptr->ip] = 0;
        g_usb_hhid_enum_seq[ptr->ip] = 0;
        g_usb_hhid_speed[ptr->ip] = 0;
        g_p_usb_hhid_config_table[ptr->ip] = 0;
        g_p_usb_hhid_device_table[ptr->ip] = 0;
        g_p_usb_hhid_interface_table[ptr->ip] = 0;

        init |= (1 << ptr->ip);
    }
}
/******************************************************************************
 End of function usb_hhid_init
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhid_registration
 Description     : registration of Host HID driver.
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void usb_hhid_registration (usb_utr_t *ptr)
{
    usb_hcdreg_t driver;
#if USB_CFG_HUB == USB_CFG_ENABLE
    uint8_t      i;
#endif  /* USB_CFG_HUB == USB_CFG_ENABLE */

    driver.ifclass    = (uint16_t)       USB_IFCLS_HID;                     /* Interface class : HID */
    driver.p_tpl      = (uint16_t*)      &g_usb_hhid_devicetpl;             /* Target peripheral list */
    driver.classinit  = (usb_cb_t)       &usb_hstd_dummy_function;          /* Driver init */
    driver.classcheck = (usb_cb_check_t) &usb_hhid_class_check;             /* Driver check */
    driver.devconfig  = (usb_cb_t)       &usb_hid_configured;               /* Device configuered */
    driver.devdetach  = (usb_cb_t)       &usb_hid_detach;                   /* Device detach */
    driver.devsuspend = (usb_cb_t)       &usb_hstd_dummy_function;          /* Device suspend */
    driver.devresume  = (usb_cb_t)       &usb_hid_resume_complete;          /* Device resume */

#if USB_CFG_HUB == USB_CFG_ENABLE
    /* WAIT_LOOP */
    for (i = 0; i < USB_MAX_DEVICE; i++)                                    /* Loop support HID device count */
    {
        usb_hstd_driver_registration(ptr, &driver);                         /* Host HID class driver registration. */
    }
#if (BSP_CFG_RTOS_USED == 0)    /* Non-OS */
    usb_cstd_set_task_pri(USB_HUB_TSK, USB_PRI_3);                          /* Hub Task Priority set */
#endif /* (BSP_CFG_RTOS_USED == 0) */
    usb_hhub_registration(ptr, (usb_hcdreg_t *) USB_NULL);                  /* Hub registration. */
#else   /* USB_CFG_HUB == USB_CFG_ENABLE */
    usb_hstd_driver_registration(ptr, &driver);                             /* Host HID class driver registration. */
#endif  /* USB_CFG_HUB == USB_CFG_ENABLE */
}
/******************************************************************************
 End of function usb_hhid_registration
 ******************************************************************************/

