TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB_HHID/BDF_BCDF_USB_HHID_CK_RX65N_V_2/trash/2025-01-12-13-43-35/src/smc_gen/r_usb_hhid/src/r_usb_hhid_driver.c
/******************************************************************************
 Function Name   : usb_hhid_driver_start
 Description     : USB Host Initialize process
 Arguments       : usb_utr_t    *ptr : Pointer to usb_utr_t structure.
 Return          : none
 ******************************************************************************/
void usb_hhid_driver_start (usb_utr_t *ptr)
{
    static uint8_t init = 0;
    uint16_t    i;

    if (0 == (init & (1 << ptr->ip)))
    {
        /* WAIT_LOOP */
        for (i =0; i< (USB_MAXDEVADDR + 1); i++)
        {
            g_usb_hhid_protocol[ptr->ip][i] = 0;
            g_usb_hhid_num_endpoint[ptr->ip][i] = 0;
            g_usb_hhid_outpipe_support[ptr->ip][i] = 0;
        }

        memset(g_usb_hhid_string_data[ptr->ip], 0, USB_HHID_CLSDATASIZE);
        memset(g_usb_hhid_request_setup[ptr->ip], 0, (5 * 2));
        memset((void *)&usb_shhid_string_req[ptr->ip], 0,sizeof(usb_utr_t));

        g_usb_hhid_devaddr[ptr->ip] = 0;
        g_usb_hhid_enum_seq[ptr->ip] = 0;
        g_usb_hhid_speed[ptr->ip] = 0;
        g_p_usb_hhid_config_table[ptr->ip] = 0;
        g_p_usb_hhid_device_table[ptr->ip] = 0;
        g_p_usb_hhid_interface_table[ptr->ip] = 0;

        init |= (1 << ptr->ip);
    }

#if (BSP_CFG_RTOS_USED == 0)    /* Non-OS */
    usb_cstd_set_task_pri(USB_HHID_TSK, USB_PRI_3); /* Host HID task priority set */
#endif /* (BSP_CFG_RTOS_USED == 0) */
}
/******************************************************************************
 End of function usb_hhid_driver_start()
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hhid_set_pipe_registration
 Description     : Host HID Pipe registration
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     devadr      : Device address
 Return          : none
 ******************************************************************************/
void usb_hhid_set_pipe_registration (usb_utr_t *ptr, uint16_t devadr)
{
    uint8_t pipe_no;

    /* Search use pipe block */
    /* WAIT_LOOP */
    for (pipe_no = USB_MIN_PIPE_NO; pipe_no < (USB_MAX_PIPE_NO +1); pipe_no++)
    {   /* Check use block */
        if (USB_TRUE == g_usb_pipe_table[ptr->ip][pipe_no].use_flag)
        {   /* Check USB Device address */
            if ((devadr << USB_DEVADDRBIT) == (g_usb_pipe_table[ptr->ip][pipe_no].pipe_maxp & USB_DEVSEL))
            {
                usb_hstd_set_pipe_reg (ptr, pipe_no);
            }
        }
    }
}
/******************************************************************************
 End of function usb_hhid_set_pipe_registration
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhid_get_hid_protocol
 Description     : Get HID Protocol
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     devadr      : Device address
 Return          : Hid Protocol
 ******************************************************************************/
uint8_t usb_hhid_get_hid_protocol (uint16_t ipno, uint16_t devadr)
{
    /* table[7]:Interface Descriptor-bInterfaceProtocol */
    return g_usb_hhid_protocol[ipno][devadr];
}
/******************************************************************************
 End of function usb_hhid_get_hid_protocol
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hhid_class_check
 Description     : Driver check.
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     **table     : Pointer to HID class information table
 Return value    : none
 ******************************************************************************/
void usb_hhid_class_check (usb_utr_t *ptr, uint16_t **table)
{
#if (BSP_CFG_RTOS_USED)
    uint16_t retval;
    uint16_t iproduct;
#else /* (BSP_CFG_RTOS_USED) */
    usb_mh_t p_blf;
    usb_er_t err;
    usb_clsinfo_t *cp;
#endif /* (BSP_CFG_RTOS_USED) */

    g_p_usb_hhid_device_table[ptr->ip]    = (uint8_t*) ((uint16_t*) table[0]);  /* Device Descriptor Table */
    g_p_usb_hhid_config_table[ptr->ip]    = (uint8_t*) ((uint16_t*) table[1]);  /* Configuration Descriptor Table */
    g_usb_hhid_speed[ptr->ip]             = (uint16_t) (*table[6]);             /* Device speed */
    g_usb_hhid_devaddr[ptr->ip]           = (uint16_t) (*table[7]);             /* Device Address */
    g_p_usb_hhid_interface_table[ptr->ip] = (uint8_t*) ((uint16_t*) table[2]);  /* Interface Descriptor Table */
    g_usb_hhid_protocol[ptr->ip][g_usb_hhid_devaddr[ptr->ip]] =
            g_p_usb_hhid_interface_table[ptr->ip][USB_B_INTERFACE_PROTOCOL];    /* Interface Protocol */

    g_usb_hhid_num_endpoint[ptr->ip][g_usb_hhid_devaddr[ptr->ip]] =
            g_p_usb_hhid_interface_table[ptr->ip][USB_IF_B_NUMENDPOINTS];       /* Num Endpoints */

    /* Enumeration Sequence String Descriptor #0 receive request */
    g_usb_hhid_enum_seq[ptr->ip] = (uint16_t) USB_HHID_ENUM_STR_DT0_REQ;

    /* Descriptor check result */
    *table[3] = USB_OK;

#if (BSP_CFG_RTOS_USED)
    /* Get String Descriptors */
    iproduct = g_p_usb_hhid_device_table[ptr->ip][USB_DEV_I_PRODUCT];
    retval = usb_hhid_get_string_info(ptr, g_usb_hhid_devaddr[ptr->ip], iproduct);
    if (USB_OK != retval)
    {
        USB_PRINTF0("   GetDescriptor(String) failed!     \n");
        *table[3] = USB_ERROR;
        return;
    }

#else /* (BSP_CFG_RTOS_USED) */
    /* Get mem block from pool. */
    if ( USB_PGET_BLK(USB_HHID_MPL, &p_blf) == USB_OK)
    {
        cp = (usb_clsinfo_t*) p_blf;
        cp->msghead = (usb_mh_t) USB_NULL;
        cp->msginfo = USB_HHID_TCMD_OPEN; /* Set message information :USB transfer. */
        cp->ip = ptr->ip; /* IP number(0or1) */
        cp->ipp = ptr->ipp; /* IP address (USB0 or USB1) */

        /* Send message */
        err = USB_SND_MSG(USB_HHID_MBX, (usb_msg_t* )cp);
        if (USB_OK != err)
        {
            /* Error */
            err = USB_REL_BLK(USB_HHID_MPL, (usb_mh_t )p_blf);
            USB_PRINTF1("Host Sample snd_msg error %x\n", err);

            /* Transfer start request send NG */
        }
    }
    else
    {
        /* Error */
        /* WAIT_LOOP */
        while (1)
        {
            /* error */
        }
    }
#endif  /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hhid_class_check
 ******************************************************************************/


#if (BSP_CFG_RTOS_USED)
/******************************************************************************
 Function Name   : usb_hhid_get_string_info
 Description     : Get string descriptors.
 Argument        : usb_utr_t *mess
                   uint16_t addr
                   uint16_t string
 Return value    : none
 ******************************************************************************/
uint16_t usb_hhid_get_string_info(usb_utr_t *mess, uint16_t addr, uint16_t string)
{
    uint16_t retval;
    uint8_t protocol;
    uint8_t *p_desc;
    uint8_t *p_iftable;
    uint16_t desc_len;

    /* Send GetDescriptor(String) */
    retval = usb_hhid_get_string_desc(mess, addr, (uint16_t)0, usb_hhid_req_trans_result);
    if (USB_OK != retval)
    {
        return USB_ERROR;
    }

    /* Send GetDescriptor(String) */
    retval = usb_hhid_get_string_desc(mess, addr, (uint16_t)string, usb_hhid_req_trans_result);
    if (USB_OK != retval)
    {
        return USB_ERROR;
    }

