TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB_HHID/BDF_BCDF_USB_HHID_CK_RX65N_V_2/trash/2025-01-12-13-43-35/src/smc_gen/r_usb_hhid/src/r_usb_hhid_driver.c
    protocol = usb_hhid_get_hid_protocol(mess->ip, g_usb_hhid_devaddr[mess->ip]); /* Get HID Protocol */
    if ((USB_HID_KEYBOARD != protocol) && (USB_HID_MOUSE != protocol))
    {
        USB_PRINTF0("### Device information error !\n");

        /* Enumeration Sequence Complete */
        g_usb_hhid_enum_seq[mess->ip] = USB_HHID_ENUM_COMPLETE;

        /* Enumeration class check error */
        retval = USB_ERROR;
    }

    p_desc = g_p_usb_hhid_config_table[mess->ip];

    desc_len = ((uint16_t) *(p_desc + 3)) << 8;
    desc_len += (uint16_t) *(p_desc + 2);

    /* Searching InterfaceDescriptor */
    p_iftable = g_p_usb_hhid_interface_table[mess->ip];

    desc_len = desc_len - (p_iftable - p_desc);

    /* pipe information table set */
    retval = usb_hhid_pipe_info(mess, p_iftable, g_usb_hhid_speed[mess->ip], desc_len);
    if (USB_ERROR == retval)
    {
        USB_PRINTF0("### Device information error !\n");

        /* Enumeration Sequence Complete */
        g_usb_hhid_enum_seq[mess->ip] = USB_HHID_ENUM_COMPLETE;

        /* Enumeration class check error */
        retval = USB_ERROR;
        usb_hstd_connect_err_event_set(mess->ip);
    }
    else
    {
        /* Enumeration Sequence Complete */
        g_usb_hhid_enum_seq[mess->ip] = USB_HHID_ENUM_COMPLETE;

        /* Enumeration class check OK */
        retval = USB_OK;
    }

    return retval;
}
/******************************************************************************
 End of function usb_hhid_get_string_info
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhid_req_trans_result
 Description     : Send a message to notify the result of the hhid class request (PIPE0).
 Argument        : usb_utr_t *mess
                   uint16_t data1
                   uint16_t data2
 Return value    : none
 ******************************************************************************/
void usb_hhid_req_trans_result(usb_utr_t *p_mess, uint16_t data1, uint16_t data2)
{
#if (BSP_CFG_RTOS_USED == 0)    /* Non-OS */
    usb_er_t err;
#else /* (BSP_CFG_RTOS_USED == 0) */
    rtos_err_t  ret;
#endif /* (BSP_CFG_RTOS_USED == 0) */

#if (BSP_CFG_RTOS_USED == 0)    /* Non-OS */
    /* Send a message to HHID mailbox */
    err = USB_SND_MSG(USB_HHID_MBX, (usb_msg_t *)p_mess);
    if (USB_OK != err)
    {
        USB_PRINTF1("### HHID snd_msg error (%ld)\n", err);
    }
#else /* (BSP_CFG_RTOS_USED == 0) */
    ret = rtos_send_mailbox (&g_rtos_usb_hhid_mbx_id, (void *)p_mess);
    if (RTOS_SUCCESS != ret)
    {
        USB_PRINTF1("### HHID snd_msg error (%ld)\n", ret);
    }
#endif /* (BSP_CFG_RTOS_USED == 0) */
}
/******************************************************************************
 End of function usb_hhid_req_trans_result
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhid_req_trans_wait_tmo
 Description     : Receive the result of the hhid class request with a timeout (PIPE0).
 Argument        : uint16_t tmo     : Time-out value.
 Return value    : USB_OK/USB_ERROR
 ******************************************************************************/
uint16_t usb_hhid_req_trans_wait_tmo(uint16_t tmo)
{
    usb_utr_t *p_mess;
#if (BSP_CFG_RTOS_USED == 0)    /* Non-OS */
    usb_er_t err;
#else /* (BSP_CFG_RTOS_USED == 0) */
    rtos_err_t  ret;
#endif /* (BSP_CFG_RTOS_USED == 0) */

#if (BSP_CFG_RTOS_USED == 0)    /* Non-OS */
    /* Receive message from HHID mailbox with time-out */
    err = USB_TRCV_MSG(USB_HHID_MBX, (usb_msg_t **)&p_mess, (usb_tm_t)tmo);
    if (USB_OK != err)
    {
        USB_PRINTF1("### HHID trcv_msg error (%ld)\n", err);
        return USB_ERROR;
    }
#else /* (BSP_CFG_RTOS_USED == 0) */
    ret = rtos_receive_mailbox (&g_rtos_usb_hhid_mbx_id, (void **)&p_mess, (rtos_time_t)tmo);
    if (RTOS_SUCCESS != ret)
    {
        USB_PRINTF1("### HHID snd_msg error (%ld)\n", ret);
    }
#endif /* (BSP_CFG_RTOS_USED == 0) */

    return (p_mess->status);
}
/******************************************************************************
 End of function usb_hhid_req_trans_wait_tmo
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED) */


  #endif /* BSP_CFG_RTOS_USED != 5 !Azure RTOS */
#endif /* defined(USB_CFG_HHID_USE) */
/******************************************************************************
 End  Of File
 ******************************************************************************/
